# 各药房饮片用例

# 广誉远真爱门诊部【西安】
zhen_ai_men_zhen = [
    {
        "title": "1.真爱门诊，颗粒（7剂，内服）",
        "drug_type": "配方颗粒",
        "sup_name": "广誉远真爱门诊部【西安】",
        "details": {
            "菊花": 20,
            "薄荷": 20,
            "山药": 13
        },
        "med_type": 0,
        "tot_num": "7",
        "sign_num": ["1", "2", "3"]
    },
    {
        "title": "2.真爱门诊，颗粒（7剂，外用）",
        "drug_type": "配方颗粒",
        "sup_name": "广誉远真爱门诊部【西安】",
        "details": {
            "菊花": 20,
            "薄荷": 20,
            "山药": 13
        },
        "med_type": 1,
        "tot_num": "7",
        "sign_num": ["1", "2", "3"]
    },
    {
        "title": "3.真爱门诊，颗粒（99剂，内服）",
        "drug_type": "配方颗粒",
        "sup_name": "广誉远真爱门诊部【西安】",
        "details": {
            "菊花": 20,
            "薄荷": 20,
            "山药": 13
        },
        "med_type": 0,
        "tot_num": "99",
        "sign_num": ["1", "2", "3"]
    },
    {
        "title": "4.真爱门诊，颗粒（1剂，内服）",
        "drug_type": "配方颗粒",
        "sup_name": "广誉远真爱门诊部【西安】",
        "details": {
            "菊花": 20,
            "薄荷": 20,
            "山药": 13
        },
        "med_type": 0,
        "tot_num": "1",
        "sign_num": ["1", "2", "3"]
    }
]
