# 各药房饮片用例

# 广誉远真爱门诊部【西安】
zhen_ai_men_zhen = [
    {
        "title": "1.真爱门诊，饮片（7剂，内服，代煎）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远真爱门诊部【西安】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 0,
        "brew_list": ["150 ml/袋", "200 ml/袋", "250 ml/袋"],
        "tot_num": "7",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "2.真爱门诊，饮片（7剂，内服，自煎）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远真爱门诊部【西安】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 1,
        "brew_list": [
            "150 ml/袋",
            "200 ml/袋",
            "250 ml/袋"
        ],
        "tot_num": "7",
        "sign_num": [
            "1",
            "2",
            "3",
            "4"
        ]
    },
    {
        "title": "3.真爱门诊，饮片（7剂，外用，代煎）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远真爱门诊部【西安】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 1,
        "brew_flag": 0,
        "brew_list": ["150 ml/袋", "200 ml/袋", "250 ml/袋"],
        "tot_num": "7",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "4.真爱门诊，饮片（7剂，外用，自煎）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远真爱门诊部【西安】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 1,
        "brew_flag": 1,
        "brew_list": ["150 ml/袋", "200 ml/袋", "250 ml/袋"],
        "tot_num": "7",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "5.真爱门诊，饮片（3剂，内服，代煎）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远真爱门诊部【西安】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 0,
        "brew_list": ["150 ml/袋", "200 ml/袋", "250 ml/袋"],
        "tot_num": "3",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "6.真爱门诊，饮片（99剂，内服，代煎）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远真爱门诊部【西安】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 0,
        "brew_list": ["150 ml/袋", "200 ml/袋", "250 ml/袋"],
        "tot_num": "99",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "7.真爱门诊，饮片（2剂，内服，代煎，异常）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远真爱门诊部【西安】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 0,
        "brew_list": ["150 ml/袋", "200 ml/袋", "250 ml/袋"],
        "tot_num": "2",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "8.真爱门诊，饮片（2剂，内服，自煎，异常）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远真爱门诊部【西安】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 1,
        "brew_list": ["150 ml/袋", "200 ml/袋", "250 ml/袋"],
        "tot_num": "2",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "9.真爱门诊，饮片（100剂，内服，代煎，异常）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远真爱门诊部【西安】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 0,
        "brew_list": ["150 ml/袋", "200 ml/袋", "250 ml/袋"],
        "tot_num": "100",
        "sign_num": ["1", "2", "3", "4"]
    }
]

# 国药江康【江苏】
guo_yao_jiang_kang = [
    {
        "title": "1.国药江康，饮片（7剂，内服，代煎）",
        "drug_type": "中药饮片",
        "sup_name": "国药江康【江苏】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 0,
        "brew_list": ["100 ml/袋", "200 ml/袋"],
        "tot_num": "7",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "2.国药江康，饮片（7剂，内服，自煎）",
        "drug_type": "中药饮片",
        "sup_name": "国药江康【江苏】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 1,
        "brew_list": ["100 ml/袋", "200 ml/袋"],
        "tot_num": "7",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "3.国药江康，饮片（7剂，外用，代煎）",
        "drug_type": "中药饮片",
        "sup_name": "国药江康【江苏】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 1,
        "brew_flag": 0,
        "brew_list": ["100 ml/袋", "200 ml/袋"],
        "tot_num": "7",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "4.国药江康，饮片（7剂，外用，自煎）",
        "drug_type": "中药饮片",
        "sup_name": "国药江康【江苏】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 1,
        "brew_flag": 1,
        "brew_list": ["100 ml/袋", "200 ml/袋"],
        "tot_num": "7",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "5.国药江康，饮片（3剂，内服，代煎）",
        "drug_type": "中药饮片",
        "sup_name": "国药江康【江苏】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 0,
        "brew_list": ["100 ml/袋", "200 ml/袋"],
        "tot_num": "3",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "6.国药江康，饮片（99剂，内服，代煎）",
        "drug_type": "中药饮片",
        "sup_name": "国药江康【江苏】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 0,
        "brew_list": ["100 ml/袋", "200 ml/袋"],
        "tot_num": "99",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "7.国药江康，饮片（2剂，内服，代煎，异常）",
        "drug_type": "中药饮片",
        "sup_name": "国药江康【江苏】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 0,
        "brew_list": ["100 ml/袋", "200 ml/袋"],
        "tot_num": "2",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "8.国药江康，饮片（2剂，内服，自煎）",
        "drug_type": "中药饮片",
        "sup_name": "国药江康【江苏】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 1,
        "brew_list": ["100 ml/袋", "200 ml/袋"],
        "tot_num": "2",
        "sign_num": ["1", "2", "3", "4"]
    },
]

# 广誉远精品中药【北京】
gyy_jin_pin = [
    {
        "title": "1.广誉远精品，饮片（7剂，内服，代煎）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远精品中药【北京】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 0,
        "brew_list": ["100 ml/袋", "120 ml/袋", "150 ml/袋", "180 ml/袋", "200 ml/袋", "240 ml/袋"],
        "tot_num": "7",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "2.广誉远精品，饮片（7剂，内服，自煎）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远精品中药【北京】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 1,
        "brew_list": ["100 ml/袋", "120 ml/袋", "150 ml/袋", "180 ml/袋", "200 ml/袋", "240 ml/袋"],
        "tot_num": "7",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "3.广誉远精品，饮片（7剂，外用，代煎）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远精品中药【北京】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 1,
        "brew_flag": 0,
        "brew_list": ["100 ml/袋", "120 ml/袋", "150 ml/袋", "180 ml/袋", "200 ml/袋", "240 ml/袋"],
        "tot_num": "7",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "4.广誉远精品，饮片（7剂，外用，自煎）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远精品中药【北京】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 1,
        "brew_flag": 1,
        "brew_list": ["100 ml/袋", "120 ml/袋", "150 ml/袋", "180 ml/袋", "200 ml/袋", "240 ml/袋"],
        "tot_num": "7",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "5.广誉远精品，饮片（3剂，内服，代煎）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远精品中药【北京】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 0,
        "brew_list": ["100 ml/袋", "120 ml/袋", "150 ml/袋", "180 ml/袋", "200 ml/袋", "240 ml/袋"],
        "tot_num": "3",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "6.广誉远精品，饮片（99剂，内服，代煎）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远精品中药【北京】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 0,
        "brew_list": ["100 ml/袋", "120 ml/袋", "150 ml/袋", "180 ml/袋", "200 ml/袋", "240 ml/袋"],
        "tot_num": "99",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "7.广誉远精品，饮片（2剂，内服，代煎，异常）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远精品中药【北京】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 0,
        "brew_list": ["100 ml/袋", "120 ml/袋", "150 ml/袋", "180 ml/袋", "200 ml/袋", "240 ml/袋"],
        "tot_num": "2",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "8.广誉远精品，饮片（2剂，内服，自煎）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远精品中药【北京】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 1,
        "brew_list": ["100 ml/袋", "120 ml/袋", "150 ml/袋", "180 ml/袋", "200 ml/袋", "240 ml/袋"],
        "tot_num": "2",
        "sign_num": ["1", "2", "3", "4"]
    },
]

# 广誉远精品中药(精选)【北京】
gyy_jin_pin_jx = [
    {
        "title": "1.广誉远精选，饮片（7剂，内服，代煎）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远精品中药(精选)【北京】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 0,
        "brew_list": ["100 ml/袋", "120 ml/袋", "150 ml/袋", "180 ml/袋", "200 ml/袋", "240 ml/袋"],
        "tot_num": "7",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "2.广誉远精选，饮片（7剂，内服，自煎）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远精品中药(精选)【北京】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 1,
        "brew_list": ["100 ml/袋", "120 ml/袋", "150 ml/袋", "180 ml/袋", "200 ml/袋", "240 ml/袋"],
        "tot_num": "7",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "3.广誉远精选，饮片（7剂，外用，代煎）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远精品中药(精选)【北京】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 1,
        "brew_flag": 0,
        "brew_list": ["100 ml/袋", "120 ml/袋", "150 ml/袋", "180 ml/袋", "200 ml/袋", "240 ml/袋"],
        "tot_num": "7",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "4.广誉远精选，饮片（7剂，外用，自煎）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远精品中药(精选)【北京】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 1,
        "brew_flag": 1,
        "brew_list": ["100 ml/袋", "120 ml/袋", "150 ml/袋", "180 ml/袋", "200 ml/袋", "240 ml/袋"],
        "tot_num": "7",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "5.广誉远精选，饮片（3剂，内服，代煎）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远精品中药(精选)【北京】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 0,
        "brew_list": ["100 ml/袋", "120 ml/袋", "150 ml/袋", "180 ml/袋", "200 ml/袋", "240 ml/袋"],
        "tot_num": "3",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "6.广誉远精选，饮片（99剂，内服，代煎）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远精品中药(精选)【北京】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 0,
        "brew_list": ["100 ml/袋", "120 ml/袋", "150 ml/袋", "180 ml/袋", "200 ml/袋", "240 ml/袋"],
        "tot_num": "99",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "7.广誉远精选，饮片（2剂，内服，代煎，异常）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远精品中药(精选)【北京】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 0,
        "brew_list": ["100 ml/袋", "120 ml/袋", "150 ml/袋", "180 ml/袋", "200 ml/袋", "240 ml/袋"],
        "tot_num": "2",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "8.广誉远精选，饮片（2剂，内服，自煎）",
        "drug_type": "中药饮片",
        "sup_name": "广誉远精品中药(精选)【北京】",
        "details": {
            "枸杞子": 15,
            "夏枯草": 15,
            "菊花": 20
        },
        "med_type": 0,
        "brew_flag": 1,
        "brew_list": ["100 ml/袋", "120 ml/袋", "150 ml/袋", "180 ml/袋", "200 ml/袋", "240 ml/袋"],
        "tot_num": "2",
        "sign_num": ["1", "2", "3", "4"]
    },
]

# 寿南山【海南】
shou_nan_shan = [
    {
        "title": "1.寿南山，饮片（7剂，内服，自煎）",
        "drug_type": "中药饮片",
        "sup_name": "寿南山【海南】",
        "details": {
            "菟丝子": 15,
            "姜天麻": 10,
            "生薏苡仁": 20
        },
        "med_type": 0,
        "brew_flag": 1,
        "brew_list": ["100 ml/袋", "200 ml/袋"],
        "tot_num": "7",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "2.寿南山，饮片（7剂，内服，代煎，异常）",
        "drug_type": "中药饮片",
        "sup_name": "寿南山【海南】",
        "details": {
            "菟丝子": 15,
            "姜天麻": 10,
            "生薏苡仁": 20
        },
        "med_type": 0,
        "brew_flag": 0,
        "brew_list": ["100 ml/袋", "200 ml/袋"],
        "tot_num": "7",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "3.寿南山，饮片（1剂，内服，自煎）",
        "drug_type": "中药饮片",
        "sup_name": "寿南山【海南】",
        "details": {
            "北沙参": 15,
            "细辛": 3,
            "百合": 20
        },
        "med_type": 0,
        "brew_flag": 1,
        "brew_list": ["100 ml/袋", "200 ml/袋"],
        "tot_num": "1",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "4.寿南山，饮片（99剂，内服，自煎）",
        "drug_type": "中药饮片",
        "sup_name": "寿南山【海南】",
        "details": {
            "菟丝子": 15,
            "姜天麻": 10,
            "生薏苡仁": 20
        },
        "med_type": 0,
        "brew_flag": 1,
        "brew_list": ["100 ml/袋", "200 ml/袋"],
        "tot_num": "99",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "5.寿南山，饮片（7剂，外用，自煎）",
        "drug_type": "中药饮片",
        "sup_name": "寿南山【海南】",
        "details": {
            "菟丝子": 15,
            "姜天麻": 10,
            "生薏苡仁": 20
        },
        "med_type": 1,
        "brew_flag": 1,
        "brew_list": ["100 ml/袋", "200 ml/袋"],
        "tot_num": "7",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "6.寿南山，饮片（1剂，外用，自煎）",
        "drug_type": "中药饮片",
        "sup_name": "寿南山【海南】",
        "details": {
            "菟丝子": 15,
            "姜天麻": 10,
            "生薏苡仁": 20
        },
        "med_type": 1,
        "brew_flag": 1,
        "brew_list": ["100 ml/袋", "200 ml/袋"],
        "tot_num": "1",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "7.寿南山，饮片（99剂，外用，自煎）",
        "drug_type": "中药饮片",
        "sup_name": "寿南山【海南】",
        "details": {
            "菟丝子": 15,
            "姜天麻": 10,
            "生薏苡仁": 20
        },
        "med_type": 1,
        "brew_flag": 1,
        "brew_list": ["100 ml/袋", "200 ml/袋"],
        "tot_num": "99",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "8.寿南山，饮片（100剂，内服，自煎，异常）",
        "drug_type": "中药饮片",
        "sup_name": "寿南山【海南】",
        "details": {
            "菟丝子": 15,
            "姜天麻": 10,
            "生薏苡仁": 20
        },
        "med_type": 0,
        "brew_flag": 1,
        "brew_list": ["100 ml/袋", "200 ml/袋"],
        "tot_num": "100",
        "sign_num": ["1", "2", "3", "4"]
    },
    {
        "title": "8.寿南山，饮片（28剂，内服，自煎）",
        "drug_type": "中药饮片",
        "sup_name": "寿南山【海南】",
        "details": {
            "木香": 15,
            "金银花": 10,
            "金不换": 20
        },
        "med_type": 0,
        "brew_flag": 1,
        "brew_list": ["100 ml/袋", "200 ml/袋"],
        "tot_num": "28",
        "sign_num": ["1", "2", "3", "4"]
    },
]
